---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeDefaultBend.#ctor
source: html/8c3f1aad-99d2-eed4-515d-4c7ee03e9acf.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeDefaultBend.#ctor Method

Create a 180-degree bend constraint.

## Syntax (C#)
```csharp
public RebarShapeConstraint180DegreeDefaultBend()
```